app/Controllers/Publication.php

INSERT INTO `publication` (`content`, `user`) VALUES ('Otra cosa', 1)
---
    public function add()
   /* {
        $model = new PublicationModel();

        if ($this->request->getMethod() ==='post' && $this->validate(['content' => 'required']))
        {
            $model->save(['content' => $this->request->getPost('content'), 'user' => 1]);
        }
        return redirect()->to(site_url('publication'));

    }
*/
{
    $model = new PublicationModel();

    if ($this->request->getMethod() === 'post' && $this->validate(['content' => 'required'])) {
        // Lógica para guardar la publicación
        $postId = $model->save(['content' => $this->request->getPost('content'), 'user' => 1]);

DELETE FROM `publication`
WHERE `id` IN ('2')
---
    public function delete($id)
    {
        $model = new PublicationModel();
        $model->delete($id);