app/Models/PublicationModel.php

    public function show($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `publication`